{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, 1, 28, 28], "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 32, "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "use_bias": true, "data_format": "channels_first", "dilation_rate": [1, 1], "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "kernel_size": [5, 5], "name": "conv2d_1"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "trainable": true, "data_format": "channels_first", "strides": [2, 2], "name": "max_pooling2d_1"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.2}}, {"class_name": "Flatten", "config": {"data_format": "channels_first", "trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "units": 128, "name": "dense_1"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "activation": "softmax", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "units": 10, "name": "dense_2"}}], "keras_version": "2.2.2"}