{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1], "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "data_format": "channels_first", "name": "conv2d_1", "batch_input_shape": [null, 1, 28, 28], "bias_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "padding": "valid", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 32, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_first", "name": "max_pooling2d_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "seed": null, "noise_shape": null, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_first", "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "name": "dense_1", "bias_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "units": 128, "bias_constraint": null, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "name": "dense_2", "bias_regularizer": null, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "units": 123, "bias_constraint": null, "use_bias": true, "activity_regularizer": null}}], "keras_version": "2.2.2"}